Repository: bic-ed/Tidy-Assets
Catalog: tidy-assets/locale/*/LC_MESSAGES/tidy-assets.po
Languages: it_it

source: Shifts all Zenphoto JavaScript elements, including inline scripts and optionally CSS resources, to the bottom of the body element. It also offers the opportunity to remove the jQuery Migrate plugin, which is included with Zenphoto to ensure compatibility with older themes and plugins.
it_it: Sposta tutti gli elementi JavaScript di Zenphoto, compresi gli script inline e facoltativamente le risorse CSS, alla fine dell’elemento body. Offre anche l'opportunità di rimuovere il plugin jQuery Migrate, che è incluso in Zenphoto per garantire la compatibilità con vecchi temi e plugin.

source: jQuery Host
it_it: Host per jQuery

source: Select your preferred server among self hosting (recommended) or one of the CDN services listed on the jQuery website.
it_it: Scegli il server preferito tra self hosting (consigliato) e uno dei servizi CDN elencati sul sito di jQuery.

source: The self hosted version is the one provided by your Zenphoto installation.
it_it: La versione self hosted è quella fornita dalla tua installazione di Zenphoto.

source: The CDNs hosted version is
it_it: La versione ospitata su CDN è

source: <strong>Notice:</strong> Provision of assets from a CDN service is explicitly discouraged by Zenphoto guidelines. It may result in the need to be accounted for in your privacy policy terms (in some jurisdictions). Select <strong>Self Hosted</strong> if you are not sure how to do it correctly or if you want to keep full control of your site.
it_it: <strong>Avviso:</strong> Fornire assets da un servizio CDN è esplicitamente sconsigliato dalle linee guida di Zenphoto. Potrebbe essere necessario renderne conto nei termini della politica sulla privacy (in alcune giurisdizioni tra cui quella italiana). Seleziona <strong>Self Hosted</strong> se non sai come farlo correttamente o se vuoi mantenere il pieno controllo del tuo sito.

source: Remove jQuery Migrate
it_it: Rimuovi jQuery Migrate

source: Check to remove jQuery Migrate from your site front-end.
it_it: Seleziona per rimuovere jQuery Migrate dal front-end del tuo sito.

source: Check that everything works as expected after enabling this option.
it_it: Verifica che tutto funzioni come previsto dopo aver attivato questa opzione.

source: Apply to CSS assets
it_it: Includi gli asset CSS

source: Shifts the CSS assets to the bottom of the <code>body</code> element as well, just before the JavaScript elements.
it_it: Sposta anche le risorse CSS in fondo all’elemento <code>body</code>, subito prima degli elementi JavaScript.

source: Output comments
it_it: Produci commenti

source: Print comments in HTML output to let you know what has been relocated and where. Processing time is printed as well, in a comment at the end of the plugin output.
it_it: Stampa alcuni commenti nel codice HTML per permettere di capire cosa è stato spostato e dove. Sarà visualizzato anche il tempo di elaborazione, in un commento alla fine dell’output del plugin.

source: Minify inline JavaScript
it_it: Minimizza il JavaScript inline

source: With JSqueeze
it_it: Con JSqueeze

source: With JShrink
it_it: Con JShrink

source: By removing unnecessary characters, %s reduces the consolidated script size by approximately 20%%. It’s a bit faster than %s, which in return does some further optimizations as well, sparing up to 30%% of the original size. The difference in processing time between the two algorithms is very similar to the difference in compression ratios. Note that this <strong>“on the fly” minification</strong>, once inline code has already been shifted at the bottom of the DOM, <strong>is almost always useless</strong> when not counterproductive for SEO/performance optimization purposes, especially if gzip compression is enabled on the server.
it_it: Eliminando i caratteri non indispensabili, %s riduce la dimensione dello script consolidato di circa il 20%%. È un po’ più veloce di %s, che in cambio esegue anche ulteriori ottimizzazioni, risparmiando fino al 30%% della dimensione originale.La differenza tra i tempi di elaborazione dei due algoritmi è molto simile alla differenza tra i rispettivi rapporti di compressione. Si noti che questa minimizzazione <strong>“al volo”</strong>, una volta che il codice inline è già stato spostato nella parte inferiore del DOM, è quasi sempre inutile quando non controproducente allo scopo di ottimizzare SEO/prestazioni, specialmente se la compressione gzip è abilitata sul server.

source: Skip elements
it_it: Salta elementi

source: This is a filter used to prevent shifting specific elements that must remain in their original positions. For each of these items, if you have any, enter an unique identification string here, one per line. Leave blank to disable filtering.
it_it: Questo è un filtro utilizzato per evitare che vengano spostati alcuni elementi specifici che devono restare nelle loro posizioni originali. Per ciascuno di questi, se ce ne sono, inserisci qui una stringa identificativa univoca, un elemento per riga.

source: For JS and CSS files, the best candidate is of course the file link, without quotes. If the link for a CSS file is <code>href="some_path/some_file.css"</code>, you should use <code>some_path/some_file.css</code>, but even just <code>some_file.css</code> might be enough.
it_it: Per i file JS e CSS, il candidato ideale è senz’altro il link al file, senza virgolette. Se il link a un file CSS è <code>href="qualche_percorso/questo_file.css"</code>, dovresti usare <code>qualche_percorso/questo_file.css</code>, ma anche solo <code>questo_file.css</code> potrebbe funzionare.

source: For an inline JS script, you will need to spot some part of the code that is not repeated identically in any other script. It could be the name of a function, your analytics code or so. A script containing <code>function pageselectCallback</code> could be added to the list by typing <code>function pageselectCallback</code> or even just <code>pageselectCallback</code>, provided that there are no other inline script containing the same string.
it_it: Per uno script JS inline, dovrai individuare qualche pezzo di codice che non si ripete identico in nessun altro script. Potrebbe essere il nome di una funzione, il tuo codice analytics e così via. Uno script che contiene <code>function pageselectCallback</code> potrebbe essere aggiunto alla lista inserendo <code>function pageselectCallback</code> o anche solo <code>pageselectCallback</code>, purché non ci siano altri script contenenti la stessa stringa.
